{
    "lang_label": "Ngôn ngữ",
    "button_select": "Chọn",
    "button_deselect": "Bỏ chọn",
    "player_number": "Người chơi {num}",
    "opponent_ai_name": "Đối thủ AI",
    "gamemode_selection_title": "Đấu trường Mã Lệnh",
    "gamemode_selection_subtitle": "Chọn trận chiến của bạn.",
    "gamemode_pve": "Người chơi vs. AI",
    "gamemode_pve_desc": "Thử thách kỹ năng của bạn trước một đối thủ AI cao cấp.",
    "gamemode_pvp": "Người chơi vs. Người chơi",
    "gamemode_pvp_desc": "Thách đấu một người bạn trong chế độ hot-seat.",
    "gamemode_campaign": "Chiến dịch",
    "gamemode_campaign_desc": "Bắt đầu một hành trình qua các nhiệm vụ đầy thử thách.",
    "campaign_select_title": "Bản đồ Chiến dịch",
    "campaign_select_subtitle": "Chọn một nhiệm vụ để bắt đầu.",
    "campaign_level_n": "Màn {level}",
    "campaign_status_locked": "Đã khóa",
    "campaign_status_completed": "Hoàn thành",
    "campaign_back_to_menu": "Về Menu chính",
    "campaign_level_1_title": "Những bước đầu tiên",
    "campaign_level_1_desc": "Một robot hạng trung đang thách đấu bạn. Cho nó thấy tài năng của bạn.",
    "campaign_level_2_title": "Quỷ tốc độ",
    "campaign_level_2_desc": "Đối thủ này rất nhanh. Bạn sẽ cần phải thật lanh lợi để bắn trúng nó.",
    "campaign_level_3_title": "Kẻ hủy diệt",
    "campaign_level_3_desc": "Một robot bọc thép hạng nặng đang cản đường bạn. Tìm cách xuyên thủng lớp phòng thủ của nó. EP bị giới hạn.",
    "campaign_level_4_title": "Kẻ Sống Sót",
    "campaign_level_4_desc": "Robot hạng nhẹ này có thể tự sửa chữa. Hãy hạ gục nó nhanh chóng trước khi nó hồi phục.",
    "campaign_level_5_title": "Mắt Đại Bàng",
    "campaign_level_5_desc": "Một đối thủ được trang bị máy quét tầm xa. Nó sẽ thấy bạn từ xa.",
    "campaign_level_6_title": "Giao tranh Cận chiến",
    "campaign_level_6_desc": "Một robot hạng nặng với pháo plasma hủy diệt. Đừng để nó đến gần. EP bị giới hạn.",
    "campaign_level_7_title": "Thoắt ẩn thoắt hiện...",
    "campaign_level_7_desc": "Robot này sử dụng máy tạo tàng hình để biến mất. Hãy dự đoán chuyển động của nó.",
    "campaign_level_8_title": "Sốc Hệ thống",
    "campaign_level_8_desc": "Một thuyền tên lửa nhanh nhẹn có thể vô hiệu hóa các module của bạn bằng một vụ nổ EMP.",
    "campaign_level_9_title": "Pháo đài",
    "campaign_level_9_desc": "Robot hạng nặng này chậm chạp, nhưng cứng cáp và có tầm nhìn xa. Một cỗ máy phòng thủ thực thụ.",
    "campaign_level_10_title": "Blitzkrieg",
    "campaign_level_10_desc": "[TRÙM] Một cấu hình cân bằng, hung hãn. Nó sẽ lao vào bạn với bộ tăng tốc và khiên. Hãy chuẩn bị.",
    "campaign_level_11_title": "Pháo Thủy tinh",
    "campaign_level_11_desc": "Cực kỳ nhanh và khó thấy, nhưng rất mỏng manh. Chỉ cần vài phát bắn trúng là thắng.",
    "campaign_level_12_title": "Phong tỏa EMP",
    "campaign_level_12_desc": "Một bệ phóng tên lửa hạng nặng được thiết kế để vô hiệu hóa bạn từ xa. EP bị giới hạn.",
    "campaign_level_13_title": "Lính Canh",
    "campaign_level_13_desc": "Một đối thủ kiên nhẫn sử dụng khiên và máy quét để kiểm soát chiến trường.",
    "campaign_level_14_title": "Càn quét",
    "campaign_level_14_desc": "Robot này sẽ lao vào bạn với pháo plasma và khiên. Hãy giữ khoảng cách.",
    "campaign_level_15_title": "Sát thủ",
    "campaign_level_15_desc": "Một robot hạng nặng sử dụng tàng hình để tiếp cận và tung ra đòn đầu tiên mạnh mẽ. EP rất hạn chế.",
    "campaign_level_16_title": "Đánh và Chạy",
    "campaign_level_16_desc": "Nó sẽ tăng tốc, bắn tên lửa, sửa chữa, và bỏ chạy. Đừng để nó trốn thoát.",
    "campaign_level_17_title": "Kẻ Vô hiệu hóa",
    "campaign_level_17_desc": "Mục tiêu chính của robot này là bắn trúng bạn bằng EMP. Hãy né bằng mọi giá.",
    "campaign_level_18_title": "Xe tăng Plasma",
    "campaign_level_18_desc": "Một robot hạng nặng khó bị tiêu diệt và còn khó tiếp cận hơn. EP bị giới hạn.",
    "campaign_level_19_title": "Kẻ Phá hoại",
    "campaign_level_19_desc": "Robot này kết hợp tàng hình và EMP để khiến bạn bất lực trước loạt tên lửa của nó.",
    "campaign_level_20_title": "Kẻ Săn mồi Tối thượng",
    "campaign_level_20_desc": "[TRÙM] Một robot hạng nặng đáng sợ sử dụng tàng hình và bộ tăng tốc để săn lùng bạn. Không có khoảng cách nào là an toàn.",
    "campaign_level_21_title": "Ma cà rồng",
    "campaign_level_21_desc": "Một robot mỏng manh dựa vào module sửa chữa để sống sót lâu hơn bạn. Hãy áp đảo nó. EP bị giới hạn nghiêm ngặt.",
    "campaign_level_22_title": "Kẻ Thích Kiểm soát",
    "campaign_level_22_desc": "Nó sẽ dùng khiên để chống đỡ đòn tấn công của bạn, sau đó phản công bằng EMP.",
    "campaign_level_23_title": "Bất khả xâm phạm",
    "campaign_level_23_desc": "Chỉ là một cục máu và giáp khổng lồ với một khẩu laser. Bạn có thể xuyên thủng nó không?",
    "campaign_level_24_title": "Bóng ma",
    "campaign_level_24_desc": "Một tay bắn tỉa tên lửa tàng hình sử dụng máy quét để tìm bạn từ bên kia bản đồ. EP bị giới hạn.",
    "campaign_level_25_title": "Kẻ Đập phá",
    "campaign_level_25_desc": "Nó sẽ vô hiệu hóa bạn bằng EMP, sau đó nung chảy bạn bằng plasma trong khi tự sửa chữa.",
    "campaign_level_26_title": "Tổng Tấn công",
    "campaign_level_26_desc": "Một robot hạng nặng với bộ tăng tốc, khiên và tên lửa. Nó có công cụ cho mọi tình huống.",
    "campaign_level_27_title": "Xung phong Cảm tử",
    "campaign_level_27_desc": "Pháo thủy tinh tối thượng. Nó sẽ lao vào bạn với khiên và laser. Sống sót qua đợt tấn công đầu tiên. EP bị giới hạn.",
    "campaign_level_28_title": "Kẻ Rình rập",
    "campaign_level_28_desc": "Một robot tàng hình chờ đợi thời điểm hoàn hảo để tấn công bằng tên lửa của nó.",
    "campaign_level_29_title": "Kẻ Hủy diệt",
    "campaign_level_29_desc": "Robot hạng nặng này được thiết kế cho một mục đích: tiếp cận và tiêu diệt bạn bằng plasma, EMP và nanite.",
    "campaign_level_30_title": "Omega",
    "campaign_level_30_desc": "[TRÙM CUỐI] Cỗ máy tối thượng. Nó kết hợp tàng hình, EMP và pháo plasma trên một khung sườn hạng nặng. Chúc may mắn.",
    "campaign_level_31_title": "Kẻ Tấn công Bóng đêm",
    "campaign_level_31_desc": "Một robot hạng trung sử dụng tàng hình để tiếp cận bằng pháo plasma. EP bị giới hạn.",
    "campaign_level_32_title": "Bầy Đàn",
    "campaign_level_32_desc": "Một robot tên lửa hạng nhẹ sẽ cố gắng vô hiệu hóa và vượt qua bạn trong khi tự sửa chữa.",
    "campaign_level_33_title": "Thành Lũy",
    "campaign_level_33_desc": "Bệ phóng laser hạng nặng này có khiên và máy quét. Nó được chế tạo để tồn tại lâu hơn bạn.",
    "campaign_level_34_title": "Tay Đua Tên Lửa",
    "campaign_level_34_desc": "Một robot hạng trung đơn giản nhưng hiệu quả, sẽ tăng tốc về phía bạn và bắn laser. EP bị giới hạn.",
    "campaign_level_35_title": "Hiểm Họa Vô Hình",
    "campaign_level_35_desc": "Robot plasma hạng nhẹ này sử dụng tàng hình và máy quét để phục kích hoàn hảo.",
    "campaign_level_36_title": "Kẻ Hàn Gắn",
    "campaign_level_36_desc": "Một robot tên lửa hạng nặng sẽ cố gắng chịu sát thương của bạn và sửa chữa để vượt qua.",
    "campaign_level_37_title": "Sự Gián Đoạn",
    "campaign_level_37_desc": "Robot tên lửa hạng trung này có khiên và EMP. Nó được thiết kế để phá vỡ chiến lược của bạn. EP bị giới hạn.",
    "campaign_level_38_title": "Đấu Sĩ",
    "campaign_level_38_desc": "Một robot laser hạng nhẹ có khiên. Đây là một bài kiểm tra thuần túy về kỹ năng nhắm và thời gian.",
    "campaign_level_39_title": "Chiến Binh Cảm Tử",
    "campaign_level_39_desc": "Robot plasma hạng nặng này sẽ tăng tốc thẳng vào bạn. Hãy chặn nó lại trước khi nó vào tầm bắn.",
    "campaign_level_40_title": "Goliath",
    "campaign_level_40_desc": "[TRÙM] Một robot plasma hạng nặng có khiên và bộ tăng tốc. Đây là phiên bản nâng cấp của Blitzkrieg.",
    "campaign_level_41_title": "Hổ Giấy",
    "campaign_level_41_desc": "Một robot tên lửa hạng nhẹ dựa vào module sửa chữa của nó. Nó không có khả năng phòng thủ. EP bị giới hạn.",
    "campaign_level_42_title": "Kẻ Xâm Nhập",
    "campaign_level_42_desc": "Một robot laser hạng trung có tàng hình và máy quét. Nó sẽ cố gắng chiến đấu từ trong bóng tối.",
    "campaign_level_43_title": "Hệ Thống Sụp Đổ",
    "campaign_level_43_desc": "Bệ phóng laser hạng nặng này sẽ cố gắng vô hiệu hóa bạn bằng EMP và sửa chữa mọi thiệt hại bạn gây ra.",
    "campaign_level_44_title": "Quân Đột Kích",
    "campaign_level_44_desc": "Một robot plasma hạng nhẹ có khiên và EMP. Nó được thiết kế cho sự hỗn loạn ở cự ly gần.",
    "campaign_level_45_title": "Kẻ Đánh Chặn",
    "campaign_level_45_desc": "Một robot tên lửa hạng trung có bộ tăng tốc. Nó sẽ cố gắng duy trì khoảng cách hoàn hảo. EP bị giới hạn.",
    "campaign_level_46_title": "Kẻ Ẩn Nấp",
    "campaign_level_46_desc": "Một robot plasma hạng nặng có tàng hình và máy quét. Một sự kết hợp chết người.",
    "campaign_level_47_title": "Cái Gai",
    "campaign_level_47_desc": "Robot laser hạng nhẹ này sử dụng bộ tăng tốc để tiếp cận và module sửa chữa để rút lui.",
    "campaign_level_48_title": "Bức Tường Khiên",
    "campaign_level_48_desc": "Một robot tên lửa hạng trung có khiên. Một sự kết hợp đơn giản nhưng hiệu quả. EP bị giới hạn.",
    "campaign_level_49_title": "Màn Đêm",
    "campaign_level_49_desc": "Một robot tên lửa hạng nặng có EMP. Nó sẽ cố gắng vô hiệu hóa bạn từ xa.",
    "campaign_level_50_title": "Nemesis",
    "campaign_level_50_desc": "[TRÙM] Một robot tên lửa hạng nặng có khiên và EMP. Nó sẽ kiểm soát trận đấu.",
    "campaign_level_51_title": "Con Đỉa",
    "campaign_level_51_desc": "Robot plasma hạng nhẹ này chỉ có module sửa chữa. Bạn phải gây sát thương nhiều hơn khả năng hồi phục của nó. EP bị giới hạn.",
    "campaign_level_52_title": "Bóng Ma",
    "campaign_level_52_desc": "Một robot laser hạng trung dựa vào tàng hình. Hãy theo dõi chuyển động của nó cẩn thận.",
    "campaign_level_53_title": "Con Rùa",
    "campaign_level_53_desc": "Một robot plasma hạng nặng có module sửa chữa và máy quét. Đây là một cuộc chiến chậm rãi, bào mòn.",
    "campaign_level_54_title": "Thiên Thạch",
    "campaign_level_54_desc": "Một robot tên lửa hạng nhẹ có khiên và bộ tăng tốc. Nó cực kỳ nhanh và khó bị ghìm chân.",
    "campaign_level_55_title": "Kẻ Gây Rối",
    "campaign_level_55_desc": "Một robot plasma hạng trung có EMP. Nó muốn đến gần và vô hiệu hóa bạn. EP bị giới hạn.",
    "campaign_level_56_title": "Thợ Săn",
    "campaign_level_56_desc": "Một robot laser hạng nặng có tàng hình và bộ tăng tốc. Nó sẽ cố gắng tấn công bạn từ bên sườn.",
    "campaign_level_57_title": "Y Sĩ",
    "campaign_level_57_desc": "Robot laser hạng nhẹ này có module sửa chữa và máy quét. Nó sẽ cố gắng thả diều bạn.",
    "campaign_level_58_title": "Kẻ Phá Vỡ",
    "campaign_level_58_desc": "Một robot tên lửa hạng trung có khiên và EMP. Nó sẽ thử thách khả năng phòng thủ của bạn. EP bị giới hạn.",
    "campaign_level_59_title": "Cái Đe",
    "campaign_level_59_desc": "Một robot plasma hạng nặng có module sửa chữa. Một hạt dẻ khó nhằn.",
    "campaign_level_60_title": "Tử Thần",
    "campaign_level_60_desc": "[TRÙM] Một robot tên lửa hạng trung có tàng hình và bộ tăng tốc. Nó sẽ tấn công từ nơi không ngờ tới.",
    "campaign_level_61_title": "Tia Lửa",
    "campaign_level_61_desc": "Một robot laser hạng nhẹ có khiên và EMP. Một kẻ gây phiền nhiễu. EP bị giới hạn.",
    "campaign_level_62_title": "Giám Sát Viên",
    "campaign_level_62_desc": "Một robot tên lửa hạng nặng có module sửa chữa và máy quét. Nó sẽ kiểm soát bản đồ.",
    "campaign_level_63_title": "Kẻ Gây Gổ",
    "campaign_level_63_desc": "Một robot plasma hạng trung có khiên. Nó muốn áp sát bạn.",
    "campaign_level_64_title": "Sao Chổi",
    "campaign_level_64_desc": "Robot tên lửa hạng nhẹ này sử dụng tàng hình và bộ tăng tốc để thực hiện các cuộc tấn công bất ngờ.",
    "campaign_level_65_title": "Kẻ Dập Tắt",
    "campaign_level_65_desc": "Một robot laser hạng nặng có EMP. Nó sẽ cố gắng chiến thắng trong một cuộc đấu súng trực diện sau khi vô hiệu hóa bạn. EP bị giới hạn.",
    "campaign_level_66_title": "Trinh Sát",
    "campaign_level_66_desc": "Một robot laser hạng trung có module sửa chữa và máy quét. Nó được chế tạo để giao tranh nhỏ lẻ.",
    "campaign_level_67_title": "Cơn Bão",
    "campaign_level_67_desc": "Một robot plasma hạng nhẹ có khiên và bộ tăng tốc. Một chiến lược tấn công toàn diện.",
    "campaign_level_68_title": "Bóng Tối",
    "campaign_level_68_desc": "Robot tên lửa hạng nặng này sử dụng tàng hình để vào vị trí bắn hoàn hảo. EP bị giới hạn.",
    "campaign_level_69_title": "Pháp Sư",
    "campaign_level_69_desc": "Một robot plasma hạng trung có module sửa chữa và EMP. Một đối thủ khó lường.",
    "campaign_level_70_title": "Khổng Lồ",
    "campaign_level_70_desc": "[TRÙM] Một robot plasma hạng nặng có khiên và máy quét. Một pháo đài di động.",
    "campaign_level_71_title": "Con Muỗi",
    "campaign_level_71_desc": "Một robot tên lửa hạng nhẹ có module sửa chữa và bộ tăng tốc. Nó khó chịu và khó bị tiêu diệt. EP bị giới hạn.",
    "campaign_level_72_title": "Cai Ngục",
    "campaign_level_72_desc": "Một robot laser hạng trung có tàng hình và EMP. Nó sẽ cố gắng kiểm soát các cuộc giao tranh của bạn.",
    "campaign_level_73_title": "Thành Trì",
    "campaign_level_73_desc": "Một robot laser hạng nặng có khiên. Hỏa lực và phòng thủ thuần túy.",
    "campaign_level_74_title": "Kiểm Lâm",
    "campaign_level_74_desc": "Một robot plasma hạng nhẹ có máy quét. Nó sẽ cố gắng giữ khoảng cách với bạn.",
    "campaign_level_75_title": "Hiệp Sĩ",
    "campaign_level_75_desc": "Một robot tên lửa hạng trung có module sửa chữa. Nó có thể duy trì một cuộc chiến lâu dài. EP bị giới hạn.",
    "campaign_level_76_title": "Ác Mộng",
    "campaign_level_76_desc": "Một robot plasma hạng nặng có tàng hình và bộ tăng tốc. Một kẻ phục kích đáng sợ.",
    "campaign_level_77_title": "Người Giám Hộ",
    "campaign_level_77_desc": "Một robot laser hạng nhẹ có khiên và máy quét. Nó chơi rất phòng thủ.",
    "campaign_level_78_title": "Kẻ Phá Hoại V2",
    "campaign_level_78_desc": "Một robot tên lửa hạng trung có module sửa chữa và EMP. Nó sẽ cố gắng tồn tại lâu hơn và vô hiệu hóa bạn. EP bị giới hạn.",
    "campaign_level_79_title": "Linh Hồn",
    "campaign_level_79_desc": "Một robot laser hạng nặng có tàng hình. Nó sẽ cố gắng bắn phát đầu tiên.",
    "campaign_level_80_title": "Lôi Bão",
    "campaign_level_80_desc": "[TRÙM] Một robot tên lửa hạng nhẹ có khiên và EMP. Một cơn bão tên lửa và sự gián đoạn.",
    "campaign_level_81_title": "Kẻ Gây Gổ V2",
    "campaign_level_81_desc": "Một robot plasma hạng trung có module sửa chữa và bộ tăng tốc. Nó sẽ bám lấy bạn. EP bị giới hạn.",
    "campaign_level_82_title": "Tay Bắn Tỉa",
    "campaign_level_82_desc": "Một robot tên lửa hạng nặng có tàng hình và máy quét. Mối đe dọa tầm xa tối thượng.",
    "campaign_level_83_title": "Kỹ Sư",
    "campaign_level_83_desc": "Một robot laser hạng nhẹ có module sửa chữa và EMP. Một cấu hình hỗ trợ trong một cuộc đấu tay đôi.",
    "campaign_level_84_title": "Titan",
    "campaign_level_84_desc": "Một robot plasma hạng trung có khiên và máy quét. Một cỗ máy mạnh mẽ toàn diện.",
    "campaign_level_85_title": "Kẻ Hủy Diệt V2",
    "campaign_level_85_desc": "Một robot laser hạng nặng có module sửa chữa và bộ tăng tốc. Nó không ngừng nghỉ. EP bị giới hạn.",
    "campaign_level_86_title": "Bóng Ma V2",
    "campaign_level_86_desc": "Một robot tên lửa hạng nhẹ có tàng hình. Bạn sẽ không bao giờ thấy nó đến.",
    "campaign_level_87_title": "Người Điều Khiển",
    "campaign_level_87_desc": "Một robot laser hạng trung có khiên và EMP. Nó quyết định nhịp độ của trận đấu.",
    "campaign_level_88_title": "Người Khổng Lồ",
    "campaign_level_88_desc": "Một robot plasma hạng nặng có máy quét. Nó kết hợp tầm bắn và sức mạnh. EP bị giới hạn.",
    "campaign_level_89_title": "Tiền Đạo",
    "campaign_level_89_desc": "Một robot tên lửa hạng nhẹ có module sửa chữa và bộ tăng tốc. Áp lực liên tục.",
    "campaign_level_90_title": "Hydra",
    "campaign_level_90_desc": "[TRÙM] Một robot tên lửa hạng nặng vừa có khiên vừa có thể tàng hình. Một con quái vật thực sự.",
    "campaign_level_91_title": "Chuyên Gia",
    "campaign_level_91_desc": "Một robot plasma hạng trung có module sửa chữa và máy quét. Rất hiệu quả. EP bị giới hạn.",
    "campaign_level_92_title": "Kẻ Tấn Công Chớp Nhoáng",
    "campaign_level_92_desc": "Một robot laser hạng nhẹ có khiên và bộ tăng tốc. Nó sẽ cố gắng áp đảo bạn bằng tốc độ.",
    "campaign_level_93_title": "Kẻ Vô Hiệu",
    "campaign_level_93_desc": "Một robot tên lửa hạng nặng có module sửa chữa và EMP. Nó được thiết kế để chống lại mọi thứ.",
    "campaign_level_94_title": "Ác Mộng V2",
    "campaign_level_94_desc": "Một robot laser hạng trung có tàng hình. Cấu hình sát thủ cổ điển.",
    "campaign_level_95_title": "Kẻ Tha Hóa",
    "campaign_level_95_desc": "Một robot plasma hạng nhẹ có module sửa chữa và EMP. Nó sẽ ăn mòn bạn từ trong ra ngoài. EP bị giới hạn.",
    "campaign_level_96_title": "Thập Tự Chinh",
    "campaign_level_96_desc": "Một robot laser hạng nặng có khiên và bộ tăng tốc. Cấu hình tấn công tối thượng.",
    "campaign_level_97_title": "Nhà Tiên Tri",
    "campaign_level_97_desc": "Một robot tên lửa hạng trung có tàng hình và máy quét. Nó có tất cả thông tin.",
    "campaign_level_98_title": "Lôi Bão V2",
    "campaign_level_98_desc": "Một robot plasma hạng nhẹ có khiên và EMP. Sự hỗn loạn ở cự ly gần được tinh chỉnh. EP bị giới hạn.",
    "campaign_level_99_title": "Hiện Thân",
    "campaign_level_99_desc": "Một robot tên lửa hạng nặng có module sửa chữa và bộ tăng tốc. Đỉnh cao của thiết kế cân bằng.",
    "campaign_level_100_title": "Titan Prime",
    "campaign_level_100_desc": "[TRÙM TỐI THƯỢNG] Cỗ máy hoàn hảo. Nó có tất cả. Hãy đánh bại nó để chứng tỏ bạn là nhà vô địch cuối cùng.",
    "handoff_title": "Chuyển lượt Người chơi",
    "handoff_subtitle": "Lượt của Người chơi 1 đã hoàn tất.",
    "handoff_instruction": "Vui lòng chuyển thiết bị cho Người chơi {num}.",
    "handoff_button": "Tôi đã sẵn sàng!",
    "garage_title": "Nhà chứa Robot",
    "garage_subtitle": "Lắp ráp robot của bạn với tối đa {max_ep} Điểm Năng lượng (EP).",
    "garage_ep_spent": "EP đã dùng",
    "garage_finalize_button": "Hoàn tất & Tới màn hình lập trình",
    "Chassis": "Khung sườn",
    "Weapon": "Vũ khí",
    "Defense Module": "Module Phòng thủ",
    "Utility Module": "Module Tiện ích",
    "component_chassis_light_name": "Khung Nhẹ",
    "component_chassis_light_description": "Tốc độ và sự linh hoạt cao, đánh đổi bằng độ bền.",
    "component_chassis_medium_name": "Khung Trung Bình",
    "component_chassis_medium_description": "Một lựa chọn cân bằng cho nhiều tình huống chiến đấu.",
    "component_chassis_heavy_name": "Khung Nặng",
    "component_chassis_heavy_description": "Độ bền và sức chứa module tối đa, nhưng rất chậm.",
    "component_weapon_laser_name": "Pháo Laser",
    "component_weapon_laser_description": "Vũ khí tầm xa đáng tin cậy với sát thương ổn định.",
    "component_weapon_plasma_name": "Pháo Plasma",
    "component_weapon_plasma_description": "Vũ khí tầm gần hủy diệt với sát thương diện rộng.",
    "component_weapon_missile_name": "Tên lửa Tầm nhiệt",
    "component_weapon_missile_description": "Tên lửa bắn-và-quên có khả năng bám đuổi mục tiêu, nhưng có thể bị mồi bẫy đánh lừa.",
    "component_defense_shield_name": "Khiên Năng lượng",
    "component_defense_shield_description": "Tạo ra một rào cản tạm thời để hấp thụ sát thương.",
    "component_defense_repair_name": "Nanite Sửa chữa",
    "component_defense_repair_description": "Từ từ sửa chữa robot trong một khoảng thời gian ngắn.",
    "component_defense_stealth_name": "Máy tạo Tàng hình",
    "component_defense_stealth_description": "Khiến robot trở nên vô hình trước cảm biến của đối phương trong một thời gian ngắn.",
    "component_utility_booster_name": "Bộ Tăng tốc",
    "component_utility_booster_description": "Cung cấp một cú bứt tốc ngắn nhưng mạnh mẽ.",
    "component_utility_scanner_name": "Máy quét Tầm xa",
    "component_utility_scanner_description": "Tăng tầm quét phát hiện kẻ địch một cách bị động.",
    "component_utility_emp_name": "Bom EMP",
    "component_utility_emp_description": "Vô hiệu hóa các module của đối phương trong bán kính hiệu quả trong vài giây.",
    "Health": "Máu",
    "Armor": "Giáp",
    "Speed": "Tốc độ",
    "Module Slots": "Khe Module",
    "Damage": "Sát thương",
    "Range": "Tầm bắn",
    "Fire Rate": "Tốc độ bắn",
    "Type": "Loại",
    "Shield HP": "Máu Khiên",
    "Cooldown": "Hồi chiêu",
    "Heal/s": "Hồi máu/s",
    "Duration": "Thời gian",
    "Speed Buff": "Tăng tốc",
    "Scan Range": "Tầm quét",
    "Effect": "Hiệu ứng",
    "Radius": "Bán kính",
    "ide_title": "Môi trường Lập trình AI",
    "ide_subtitle": "Viết logic cho robot của bạn hoặc dùng Trợ lý AI để tạo mã.",
    "ide_back_to_garage": "Về Nhà chứa",
    "ide_enter_arena": "Vào Đấu trường",
    "ide_editor_label": "Logic Robot (hàm update)",
    "ide_editor_placeholder": "// Logic của robot được viết ở đây...",
    "ide_ai_assistant_title": "Trợ lý AI Tạo Code",
    "ide_ai_assistant_subtitle": "Mô tả chiến thuật của bạn bằng ngôn ngữ tự nhiên.",
    "ide_ai_assistant_placeholder": "VD: Tấn công kẻ địch gần nhất, nhưng rút lui nếu máu dưới 30%.",
    "ide_ai_button_loading": "Đang tạo...",
    "ide_ai_button_generate": "Tạo Code",
    "ide_tab_api": "Tài liệu API",
    "ide_tab_console": "Bảng điều khiển",
    "ide_console_initialized": "Bảng điều khiển đã khởi tạo.",
    "ide_ai_generating": "Trợ lý AI: Đang tạo mã cho \"{prompt}\"",
    "ide_ai_retrying": "Lỗi hạn ngạch API. Đang thử lại... (Lần {attempt})",
    "ide_ai_code_comment": "Mã do AI tạo cho: \"{prompt}\"",
    "ide_ai_success": "Trợ lý AI: Đã tạo mã thành công và thêm vào trình soạn thảo.",
    "ide_ai_error": "Lỗi Trợ lý AI",
    "ide_ai_unknown_error": "Đã xảy ra lỗi không xác định.",
    "initial_code_comment_1": "Hàm update() này được gọi mỗi tick trong game.",
    "initial_code_comment_2": "Lập trình hành vi của robot của bạn tại đây.",
    "initial_code_comment_3": "Sử dụng 'self' để truy cập API của Robot.",
    "initial_code_example_comment_1": "Ví dụ: Tìm và tấn công kẻ địch gần nhất",
    "initial_code_example_comment_2": "Sắp xếp kẻ địch theo khoảng cách để tìm ra kẻ gần nhất",
    "initial_code_example_comment_3": "Ngắm và bắn vào kẻ địch gần nhất",
    "initial_code_example_comment_4": "Không thấy kẻ địch, có thể đi tuần tra",
    "initial_code_example_log_1": "Tìm thấy kẻ địch gần nhất ở khoảng cách:",
    "initial_code_example_log_2": "Không phát hiện kẻ địch, đang tuần tra.",
    "arena_title": "Giai đoạn Chiến đấu",
    "arena_subtitle": "Robot của bạn hiện đang tự hành. Hãy quan sát kết quả từ bản lắp ráp và mã lệnh của bạn.",
    "arena_match_over": "Trận đấu kết thúc. Chuyển sang màn hình Phân tích...",
    "log_sim_start": "Đang khởi tạo mô phỏng chiến đấu...",
    "log_robot_enters": "{name} tiến vào đấu trường.",
    "log_robot_moves": "{name} di chuyển đến vị trí mới.",
    "log_robot_fires": "{name} khai hỏa {weapon} vào {target}.",
    "log_robot_hit": "{target} nhận {damage} sát thương!",
    "log_robot_misses": "Phát bắn của {name} trượt {target}!",
    "log_robot_destroyed": "{name} đã bị hạ gục!",
    "log_robot_victory": "{name} chiến thắng!",
    "log_sim_complete": "Mô phỏng hoàn tất. Đang tạo phân tích...",
    "analysis_title": "Phân tích Sau trận đấu",
    "analysis_subtitle": "Xem lại hiệu suất và quyết định bước đi tiếp theo của bạn.",
    "analysis_stats_title": "Thống kê Trận đấu",
    "analysis_stat_result": "Kết quả",
    "analysis_stat_result_victory": "Thắng!",
    "analysis_stat_result_defeat": "Thua",
    "analysis_stat_result_draw": "Hòa",
    "analysis_winner_p1": "Người chơi 1 Thắng!",
    "analysis_winner_p2": "Người chơi 2 Thắng!",
    "analysis_stat_time": "Thời gian",
    "analysis_stat_damage_dealt": "Sát thương gây ra",
    "analysis_stat_damage_taken": "Sát thương nhận vào",
    "analysis_stat_accuracy": "Độ chính xác",
    "analysis_stat_modules_used": "Module đã dùng",
    "analysis_build_title": "Bản lắp ráp của bạn",
    "analysis_build_p1": "Bản lắp ráp của Người chơi 1",
    "analysis_build_p2": "Bản lắp ráp của Người chơi 2",
    "analysis_build_none": "Không có",
    "analysis_next_steps_title": "Bước tiếp theo",
    "analysis_button_new_build": "Lắp ráp mới (vs AI)",
    "analysis_button_play_again": "Chơi lại",
    "analysis_button_revise_code": "Chỉnh sửa Code",
    "analysis_button_replay": "Xem lại trận đấu (Sắp có)",
    "analysis_button_next_level": "Màn tiếp theo",
    "analysis_button_retry_level": "Thử lại Màn này",
    "analysis_button_back_to_map": "Về Bản đồ Chiến dịch"
  }